#### AnalysisDisplayStyleDiagramFenceType Enumeration

---

|  |
| --- |
| See Also |

Defines fence visualization types for diagram settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleDiagramFenceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleDiagramFenceType ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleDiagramFenceType ``` |

# Members

| Member name | Description |
| --- | --- |
| ShowAll | Show fence for each point |
| ShowNone | Don't show fence |
| ShowPredefined | Show fence only for points that have flag ValueAtPointFlags::DisplayFence |

# See Also

Autodesk.Revit.DB.Analysis Namespace